[{
        "id": 1,
        "name": "IslamiCity",
        "topic": "Allah",
        "dis":"The Arabic word Allah literally means “The God”. Believers in Islam understand Allah to be the proper name for the Creator as found in the Qur’an. The name Allah is analogous to Eloh, a Semitic term found in the divine scriptures revealed to Muhammad’s predecessors Moses and Jesus (may peace be upon them all). The use of the term Allah is not confined to believers in Islam alone — Arabic-speaking Christians and Jews also use Allah in reference to God, demonstrating thereby that followers of Islam, Christianity, and Judaism believe in a common monotheistic Creator, a fact that many people are surprised to learn. One reason for this may be that English-speaking persons are accustomed to the term God, whereas believers in Islam, regardless of their native language, use the Arabic word Allah. This difference in usage may cause people to view the term Allah with reticence and uncertainty, preventing them from making the connection between the Arabic name and the accepted English equivalent term."
    },
    {
        "id": 2,
        "name": "IslamiCity",
        "topic": "Muhammad",
        "dis": "Islam teaches that Muhammad’s role as the final prophet of God was to confirm the authentic teachings of previous prophets and to rectify mistakes or innovations that followers of previous monotheistic faith traditions had introduced into the original religion of humankind. Muhammad is also viewed as the conduit for the completion of God’s guidance to humanity; the scope of his mission is seen as encompassing all people, rather than a specific region, group or community. Furthermore, his life serves as a perfect model of how to practice Islam fully. 'And We have not sent thee (O Muhammad) save as a bringer of good tidings and a warner unto all mankind; but most of mankind know not' (Quran 34:28) - Essentially, Muslims view Islam not as a “new” religion, since it embodies the same message and guidance that God revealed to all His messengers, but rather a reestablishment of the “primordial” religion of humankind, centered around recognizing God’s Oneness and adhering to His commands. The view of Islam as having achieved its final form through the scripture given to Muhammad and his own teachings is an important aspect of faith. Consequently, Muhammad is considered the final messenger of God, the “Seal” of the Prophets. Any claimants to prophethood after Muhammad, who died in 632 C.E., are not accepted by Muslims. 'Muhammad is not the father of any man among you, but he is the messenger of Allah and the Seal of the Prophets; and Allah is Aware of all things' (Quran 33:40) -"
    },
    {
        "id": 3,
        "name": "kubepublishing",
        "topic": "Angels",
        "dis": "Allah (subhan wa ta’ala) has created many different types of creatures and one of those creatures are called Angels (or ‘al-Malaikah’ in the Quran). We usually cannot see them and they are made of pure LIGHT. They only do whatever Allah (SWT) tells them to do and they cannot ever disobey God because unlike us human’s, they have no choice of their own –they have no ‘Free Will.’ They pray, worship and glorify Allah all the time. Belief in the Angels is a big part of our Faith as Muslims, like the belief in ONE God and the many Prophets of God too. There are some very special angels who are given extra special tasks by Allah. Some of them are mentioned below. Jibrael(Gabriel): He is a very important angel. He is the angel of revelation and revealed the Quran to the Prophet Muhammad (saw). He also communicated with all the Prophet’s and is responsible for bringing down Allah’s blessings on Laylatul Qadr (The Night of Power) on one of the last 10 days of Ramadan. He is also responsible for bringing punishment on to nations who do many wrongs. Jibrael (alayhis salaam) is mentioned in the Quran several times. Mikael(Michael): Responsible for directing the rain and winds according to the will of Allah. Israfeel:Responsible for blowing the trumpet that will signal the ‘End of Time’ on this earth. Azrael: Also known as Malak al-maut(Judeo-Christian, Azrael), is the angel of death. He is responsible for parting the soul from the body. He is only referred as malak al-maut, meaning angel of death, in the Quran. Malik: The main guardian of hell. Munkar and Nakeer:Stern angels who question humans upon death as to their beliefs. They ask three questions: Who is your God? Who is your Prophet? What is your Religion? They punish those in the grave who did not believe, or were bad and disobedient in their lives. Haroot and Maroot:Two angels who came to earth and taught men some of ‘black magic’ such as breaking up family, marriage etc as a test Kirama Katibeen:These two angels sit on every person’s right and left shoulder to record his/her good or bad  "
    },
    {
        "id": 4,
        "name": "IslamiCity",
        "topic": "Islam",
        "dis":"Islam means to achieve peace – peace with God, peace within oneself, and peace with the creations of God – through wholly submitting oneself to God and accepting His guidance. The term Islam derives from the three-letter Arabic root, S (س)- L (ل)- M (م), which generates words with interrelated meanings, including “surrender”, “submission”, “commitment” and “peace”. Commonly, Islam refers to the monotheistic religion revealed to Muhammad ibn (son of) Abdullah between 610 and 632 of the Common Era. The name Islam was instituted by the Qur’an, the sacred scripture revealed to Muhammad. For believers, Islam is not a new religion. Rather, it represents the last reiteration of the primordial message of God’s Oneness, a theme found in earlier monotheistic religious traditions. Though Islam can be described as a religion, it is viewed by its adherents – a fifth of the world’s population – in much broader terms. Beyond belief in specific doctrines and performance of important ritual acts, Islam is practiced as a complete and natural way of life, designed to bring God into the center of one’s consciousness, and thus one’s life. Essentially, by definition Islam is a world view focused on belief in the One God and commitment to His commandments."
    },
    {
        "id": 5,
        "name": "IslamiCity",
        "topic": "Quran",
        "dis":"The word Qur’an literally means “the reading” or “the recitation”, and refers to the divinely revealed scripture given to Muhammad. Since Muhammad is considered the last prophet of God, the Qur’an is believed to be the final revelation from God to humanity. The Qur’an is considered by Muslims to be the literal Speech of God given to Muhammad in the Arabic language. The chapters and verses of the Qur’an were revealed throughout Prophet Muhammad’s mission, over a span of close to twenty-three years, from 610-632 C.E. Contrary to common misconception, Muhammad is not the author of the Qur’an. Rather, he is viewed as the chosen recipient of and transmitter of the revelation and the ideal implementor of principles and commandments contained therein. The personal sayings or words of Muhammad are known as hadith, which are distinct from the divine origin of the content of the Qur’an. As verses of the Qur’an were revealed to Muhammad and subsequently repeated by him to companions and other fellow Muslims, they were written down, recited and memorized. The Prophet also typically led the formal worship five times daily, during which he recited the revealed verses according to the procedure that he established. The verses were also recited out loud by designated Muslims in the early dawn hours and prior to the worship times and other important occasions. In short, the Qur’anic verses played an immediate and practical role in the spiritual lives of Muslims from the outset. Before he passed away, the Prophet arranged the 114 chapters into the sequence we find in the Qur’an as we have it today. Scholars, both Muslim and non-Muslim, agree that the Qur’an has remained intact and unchanged to the present. The Qur’an as a scripture stands unique in this regard. Translations of the Qur’an exist in many languages throughout the world, including English, Spanish, French, German, Urdu, Chinese, Malay, Vietnamese, and others. It is important to note that while translations are useful as renderings or explanations of the Qur’an, only the original Arabic text is considered to be the Qur’an itself."
    },
    {
        "id": 6,
        "name": "IslamiCity",
        "topic": "Muslims",
        "dis":"The word Muslim literally means 'one who willfully submits (to God).' Islam teaches that everything in Creation — microbes, plants, animals, mountains and rivers, planets, and so forth — is 'muslim', testifying to the majesty of the Creator and submitting or committing to His divine laws. Human beings, also, are considered fundamentally ”muslim” (submitters to God) in their original spiritual orientation, but being unique creations endowed with abilities of reason, judgement, and choice, they may remain on a God-conscious, righteous path towards divine reward, or may veer away as a consequence of upbringing and life-choices. More commonly, the term Muslim refers to one who believes in the Shahadah (the declaration of faith containing the basic creed of Islam) and embraces a lifestyle in accord with Islamic principles and values. Anybody may be or become a Muslim, regardless of gender, race, nationality, color, or social or economic status. A non-Muslim who decides to enter Islam does so by reciting the Shahadah, (pronounced La-Ilaha Ila Allah, Muhammad-un Rasool Allah) witnessing that 'there is no deity but Allah (God), and Muhammad is His Messenger.'"
    },
    {
        "id": 7,
        "name": "IslamiCity",
        "topic": "Muslims",
        "dis":"The word Muslim literally means 'one who willfully submits (to God).' Islam teaches that everything in Creation — microbes, plants, animals, mountains and rivers, planets, and so forth — is 'muslim', testifying to the majesty of the Creator and submitting or committing to His divine laws. Human beings, also, are considered fundamentally ”muslim” (submitters to God) in their original spiritual orientation, but being unique creations endowed with abilities of reason, judgement, and choice, they may remain on a God-conscious, righteous path towards divine reward, or may veer away as a consequence of upbringing and life-choices. More commonly, the term Muslim refers to one who believes in the Shahadah (the declaration of faith containing the basic creed of Islam) and embraces a lifestyle in accord with Islamic principles and values. Anybody may be or become a Muslim, regardless of gender, race, nationality, color, or social or economic status. A non-Muslim who decides to enter Islam does so by reciting the Shahadah, (pronounced La-Ilaha Ila Allah, Muhammad-un Rasool Allah) witnessing that 'there is no deity but Allah (God), and Muhammad is His Messenger.'"
    }
]